controltheory/beamer/7/7_6_ess.org
# #+LaTeX_CLASS:  article
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage[usenames]{color}
#+LATEX_HEADER: \usepackage{pstricks}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \pgfplotsset{compat=1.8}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[europeanresistors,americaninductors]{circuitikz}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{yfonts}
#+LATEX_HEADER: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{arrows,shapes}
#+LATEX_HEADER: \usetikzlibrary{intersections}
#+LATEX_HEADER: \usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
#+LATEX_HEADER: \usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
#+LATEX_HEADER: \xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
#+LATEX_HEADER: \setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
#+LATEX_HEADER: \setCJKmonofont{Evermore Kai}

#+LATEX_HEADER: \usepackage{pst-node}
#+LATEX_HEADER: \usepackage{pst-plot}
#+LATEX_HEADER: \psset{unit=5mm}


#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [table]
# #+LaTeX_CLASS_OPTIONS: [bigger]
#+latex_header:  \mode<article>{\usepackage{beamerarticle}}
# #+latex_header: \mode<beamer>{\usetheme{JuanLesPins}}
# #+latex_header: \mode<beamer>{\usetheme{Boadilla}}
#+latex_header: \mode<beamer>{\usetheme{Frankfurt}}
#+latex_header: \mode<beamer>{\usecolortheme{dove}}
#+latex_header: \mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
#+latex_header: \mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
#+latex_header: \setbeamercovered{transparent}
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+TITLE:  线性离散系统分析
#+latex_header: \subtitle{离散系统稳态误差}
#+AUTHOR:    
#+EMAIL: 
#+DATE:  
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:








* 离散系统稳态误差
** 离散系统稳态误差
 * 连续系统稳定误差:
    *  Laplacian 变换的终值定理
    * 静态误差系数
    * 动态误差系数
 * <2->离散系统稳态误差
    *  Z变换终值定理
     \begin{eqnarray*}
     \lim_{t\rightarrow\infty}e^*(t) & = &\lim_{z\rightarrow 1}(z-1)E(z)\\
      &=& \lim_{z\rightarrow 1}(z-1)\Phi_e(z)R(z)
     \end{eqnarray*}
** 离散系统稳态误差示例:
\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of p1] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](p1) edge node[midway] {$e(t)$} (s1) ; 
%\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_h(s)$}; 
%\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of s1] (g2) {$\frac{1}{s(1+0.1s)}$}; 
\path[->] (s1) edge node[midway] {$e^*(t)$} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
\path[red] node[ inner sep=5pt,below =of g2] (h) {$   $}; 
\path[draw] (g2.east)+(1em,0) |- (h.west);
\path[->,draw] (h.west) -| node [very near end] {$-$} (p1);
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\path[->] node[minimum size=2em,above =of p1] (sr) {}; 
\draw[dashed] (sr.west)--(sr.north east);\draw[dashed,->] (sr.north west) arc (70:0:1.7em);\draw[dashed] (sr.south) node {$T$};%\draw (sr.north) node[above] {$S$};
\path[dashed,draw](r.east)+(1em,0) |- (sr.west) ; 
\path node[ right =of sr] (i) {$r^*(t)$}; 
\path[dashed,->] (sr) edge node {} (i); 
\end{tikzpicture} 
其中  $T=0.1,r_1(t)=1(t),r_2(t)=t$  求离散系统相应的稳态误差

*** 解:								    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :BEAMER_envargs: <2->
    :END:
     \begin{eqnarray*}
     G(z) &=& \frac{z(1-0.368)}{(z-1)(z-0.368)} \\
     \Phi_e(z) &= &\frac{1}{1+G(z)} 
      = \frac{(z-1)(z-0.368)}{z^2-0.736z+0.368}
     \end{eqnarray*}

** 离散系统稳态误差示例(续)
*** $r_1(t) =  1(t)$ 时						    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
     \begin{eqnarray*}
     R_1(z) &=& \frac{1}{1-z^{-1}} \\
     \lim_{z\rightarrow 1}(1-z^{-1})\Phi_e(z)R(z) &=& 0
     \end{eqnarray*}
*** $r_2(t) = t(t)$ 时						    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :BEAMER_envargs: <2->
    :END:
     \begin{eqnarray*}
     R_2(z) &=& \frac{Tz^{-1}}{(1-z^{-1})^2} \\
     \lim_{z\rightarrow 1}(1-z^{-1})\Phi_e(z)R(z) &=& \lim_{z\rightarrow 1}\frac{T(z-0.368)}{z^2-0.736z+0.368}\\
      &=& T \\
      &=& 0.1
     \end{eqnarray*}
* 离散系统型别与静态误差系数
** 离散系统型别
 * 连续系统型别:  
      \[G_o(s)=\frac{M(s)}{s^{\nu}N(s)}\]  
     若  $\nu=0,1,2$  则分别称为0型,I型,II型系统.
 * <2->离散系统型别:  
      \[G_o(z)=\frac{M(z)}{(z-1)^{\nu}N(z)}\]  
     若  $\nu=0,1,2$  则分别称为0型,I型,II型系统.
      ($G_o(z)$  为单位负反馈开环脉冲传递函数)
** 静态误差系数:0型系统:
*** 连续系统						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :END:
\begin{eqnarray*}
K_p &=& \lim_{s\rightarrow 0}G_o(s)  \\
r(t)&=& 1 \\
e_{ss} &=& \frac{1}{1+K_p} 
\end{eqnarray*}
*** 离散系统						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <2->
     :END:
\begin{eqnarray*}
K_p &=& \lim_{z\rightarrow 1}(1+G_o(z))  \\
r(t)&=& 1(t) \\
e_{ss} &=& \frac{1}{K_p} 
\end{eqnarray*}
** 静态误差系数:I型系统:
*** 连续系统						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :END:
\begin{eqnarray*}
K_p &=& \lim_{s\rightarrow 0}sG_o(s)  \\
r(t)&=& t \\
e_{ss} &=& \frac{1}{K_v} 
\end{eqnarray*}
*** 离散系统						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <2->
     :END:
\begin{eqnarray*}
K_p &=& \lim_{z\rightarrow 1} (z-1)G_o(z)  \\
r(t)&=& t \\
e_{ss} &=& \frac{T}{K_v} 
\end{eqnarray*}
** 静态误差系数:II型系统:
*** 连续系统						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :END:
\begin{eqnarray*}
K_p &=& \lim_{s\rightarrow 0}s^2G_o(s)  \\
r(t)&=& \frac{t^2}{2} \\
e_{ss} &=& \frac{1}{K_a} 
\end{eqnarray*}
*** 离散系统						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.5
     :BEAMER_env: block
     :BEAMER_envargs: <2->
     :END:
\begin{eqnarray*}
K_p &=& \lim_{z\rightarrow 0}(z-1)^2G_o(s)  \\
r(t)&=& \frac{t^2}{2} \\
e_{ss} &=& \frac{T^2}{K_a} 
\end{eqnarray*}
