controltheory/beamer/7/7_6_ess.tex
% Created 2013-11-02 Sat 16:28
\documentclass[table]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{amsmath}
\usepackage[usenames]{color}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<article>{\usepackage{beamerarticle}}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{离散系统稳态误差}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性离散系统分析}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}












\section{离散系统稳态误差}
\label{sec-1}
\begin{frame}
\frametitle{离散系统稳态误差}
\label{sec-1-1}

\begin{itemize}
\item 连续系统稳定误差:
\begin{itemize}
\item Laplacian 变换的终值定理
\item 静态误差系数
\item 动态误差系数
\end{itemize}
\item <2->离散系统稳态误差
\begin{itemize}
\item Z变换终值定理
     \begin{eqnarray*}
     \lim_{t\rightarrow\infty}e^*(t) & = &\lim_{z\rightarrow 1}(z-1)E(z)\\
      &=& \lim_{z\rightarrow 1}(z-1)\Phi_e(z)R(z)
     \end{eqnarray*}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{离散系统稳态误差示例:}
\label{sec-1-2}

\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of p1] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](p1) edge node[midway] {$e(t)$} (s1) ; 
%\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_h(s)$}; 
%\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of s1] (g2) {$\frac{1}{s(1+0.1s)}$}; 
\path[->] (s1) edge node[midway] {$e^*(t)$} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
\path[red] node[ inner sep=5pt,below =of g2] (h) {$   $}; 
\path[draw] (g2.east)+(1em,0) |- (h.west);
\path[->,draw] (h.west) -| node [very near end] {$-$} (p1);
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\path[->] node[minimum size=2em,above =of p1] (sr) {}; 
\draw[dashed] (sr.west)--(sr.north east);\draw[dashed,->] (sr.north west) arc (70:0:1.7em);\draw[dashed] (sr.south) node {$T$};%\draw (sr.north) node[above] {$S$};
\path[dashed,draw](r.east)+(1em,0) |- (sr.west) ; 
\path node[ right =of sr] (i) {$r^*(t)$}; 
\path[dashed,->] (sr) edge node {} (i); 
\end{tikzpicture} 
其中  $T=0.1,r_1(t)=1(t),r_2(t)=t$  求离散系统相应的稳态误差
\begin{block}<2->{解:}
\label{sec-1-2-1}

     \begin{eqnarray*}
     G(z) &=& \frac{z(1-0.368)}{(z-1)(z-0.368)} \\
     \Phi_e(z) &= &\frac{1}{1+G(z)} 
      = \frac{(z-1)(z-0.368)}{z^2-0.736z+0.368}
     \end{eqnarray*}
\end{block}
\end{frame}
\begin{frame}
\frametitle{离散系统稳态误差示例(续)}
\label{sec-1-3}
\begin{block}{$r_1(t) =  1(t)$ 时}
\label{sec-1-3-1}

     \begin{eqnarray*}
     R_1(z) &=& \frac{1}{1-z^{-1}} \\
     \lim_{z\rightarrow 1}(1-z^{-1})\Phi_e(z)R(z) &=& 0
     \end{eqnarray*}
\end{block}
\begin{block}<2->{$r_2(t) = t(t)$ 时}
\label{sec-1-3-2}

     \begin{eqnarray*}
     R_1(z) &=& \frac{Tz^{-1}}{(1-z^{-1})^2} \\
     \lim_{z\rightarrow 1}(1-z^{-1})\Phi_e(z)R(z) &=& \lim_{z\rightarrow 1}\frac{T(z-0.368)}{z^2-0.736z+0.368}\\
      &=& T \\
      &=& 0.1
     \end{eqnarray*}
\end{block}
\end{frame}
\section{离散系统型别与静态误差系数}
\label{sec-2}
\begin{frame}
\frametitle{离散系统型别}
\label{sec-2-1}

\begin{itemize}
\item 连续系统型别:  
      \[G_o(s)=\frac{M(s)}{s^{\nu}N(s)}\]  
     若  $\nu=0,1,2$  则分别称为0型,I型,II型系统.
\item <2->离散系统型别:  
      \[G_o(z)=\frac{M(z)}{(z-1)^{\nu}N(z)}\]  
     若  $\nu=0,1,2$  则分别称为0型,I型,II型系统.
      ($G_o(z)$  为单位负反馈开环脉冲传递函数)
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{静态误差系数:0型系统:}
\label{sec-2-2}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}{连续系统}
\label{sec-2-2-1}

\begin{eqnarray*}
K_p &=& \lim_{s\rightarrow 0}G_o(s)  \\
r(t)&=& 1 \\
e_{ss} &=& \frac{1}{1+K_p} 
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{离散系统}
\label{sec-2-2-2}

\begin{eqnarray*}
K_p &=& \lim_{z\rightarrow 1}(1+G_o(z))  \\
r(t)&=& 1(t) \\
e_{ss} &=& \frac{1}{K_p} 
\end{eqnarray*}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{静态误差系数:I型系统:}
\label{sec-2-3}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}{连续系统}
\label{sec-2-3-1}

\begin{eqnarray*}
K_p &=& \lim_{s\rightarrow 0}sG_o(s)  \\
r(t)&=& t \\
e_{ss} &=& \frac{1}{K_v} 
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{离散系统}
\label{sec-2-3-2}

\begin{eqnarray*}
K_p &=& \lim_{z\rightarrow 1} (z-1)G_o(z)  \\
r(t)&=& t \\
e_{ss} &=& \frac{T}{K_v} 
\end{eqnarray*}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{静态误差系数:II型系统:}
\label{sec-2-4}
\begin{columns}
\begin{column}{0.5\textwidth}
\begin{block}{连续系统}
\label{sec-2-4-1}

\begin{eqnarray*}
K_p &=& \lim_{s\rightarrow 0}s^2G_o(s)  \\
r(t)&=& \frac{t^2}{2} \\
e_{ss} &=& \frac{1}{K_a} 
\end{eqnarray*}
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<2->{离散系统}
\label{sec-2-4-2}

\begin{eqnarray*}
K_p &=& \lim_{z\rightarrow 0}(z-1)^2G_o(s)  \\
r(t)&=& \frac{t^2}{2} \\
e_{ss} &=& \frac{T^2}{K_a} 
\end{eqnarray*}
\end{block}
\end{column}
\end{columns}
\end{frame}

\end{document}
